{
  "auto_mapping": null,
  "base_model_name_or_path": "HuggingFaceTB/SmolLM2-135M",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 9,
  "num_layers": 30,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 16,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify the sentiment as positive, negative, or neutral:",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 576,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "HuggingFaceTB/SmolLM2-135M"
}